app/Services/AuthService.php

SELECT *
FROM `users`
WHERE `email` = 'alvesjulya5@gmail.com'
 LIMIT 1
---
    public function authenticate(string $email, string $password): bool
    {
        // 1. Busca o usuário no banco (ajuste o nome das colunas se necessário)
        $user = $this->userModel->where('email', $email)->first();