app/Controllers/Home.php

    public function processRegister()
    {
        $userModel = new UserModel();

        $nome  = $this->request->getPost('nome');
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');
        $confirmaSenha = $this->request->getPost('confirma_senha');

        // 1. Verificar se as senhas coincidem
        if ($senha !== $confirmaSenha) {
            return redirect()->back()->withInput()->with('error', 'As senhas não coincidem!');
        }

        // 2.Checar se o e-mail já existe no banco
        $usuarioExistente = $userModel->where('email', $email)->first();

        if ($usuarioExistente) {
            // Se achou alguém com esse e-mail, volta para a tela com erro
            return redirect()->back()->withInput()->with('error', 'Este e-mail já está cadastrado! Tente fazer login ou use outro e-mail.');
        }

        // 3. Montar os dados para salvar
        $dadosUsuario = [
            'nome'  => $nome,
            'email' => $email,
            'senha' => password_hash($senha, PASSWORD_DEFAULT)
        ];

        // 4. Salvar no banco
        if ($userModel->insert($dadosUsuario)) {
---
SELECT *
FROM `users`
WHERE `email` = 'teste2@email.com'
 LIMIT 1
INSERT INTO `users` (`nome`, `email`, `senha`, `created_at`, `updated_at`) VALUES ('teste2', 'teste2@email.com', '$2y$10$dvsxjqPuVZN/wxlHzDkHvOLoVfLQooEIXioYZGAFeQxARQu/./Kkm', '2026-07-05 16:43:37', '2026-07-05 16:43:37')