app/Controllers/UserController.php

INSERT INTO `users` (`nome`, `email`, `senha`, `created_at`, `updated_at`) VALUES ('dani', 'danielsantosbarroso05@gmail.com', '$2y$10$snf3UpnbIx.GpFIV.KKdduVzOEGbdEwHglYriF3hVE1pOdQjEcxHi', '2026-07-06 17:45:44', '2026-07-06 17:45:44')
---
    public function register()
    {
        if ($this->request->getMethod() === 'POST') {
            $userModel = new UserModel();

            $nome  = $this->request->getPost('nome');
            $email = $this->request->getPost('email');
            $senha = $this->request->getPost('senha');
            $confirma = $this->request->getPost('confirma_senha'); // Ajuste conforme seu form

            // Validação de senha
            if ($senha !== $confirma) {
                return redirect()->back()->withInput()->with('erro', 'As senhas não coincidem.');
            }

            $data = [
                'nome'  => $nome,
                'email' => $email,
                'senha' => password_hash((string) $senha, PASSWORD_DEFAULT),
            ];

            if ($userModel->insert($data)) {

SELECT *
FROM `users`
WHERE `reset_token` = '21d5bddff051915614a893e59687f9b626041d1bddf9735d48ce7de0d93957b6'
AND `reset_expires_at` >= '2026-07-06 17:52:48'
 LIMIT 1
---
    public function resetPassword($token = null)
    {
        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('reset_token', $token)
            ->where('reset_expires_at >=', date('Y-m-d H:i:s'))
            ->first();