app/Models/TeamModel.php

SELECT *
FROM `teams`
WHERE `user_id` = '2'
---
    public function getTeamsByUser($userId)
    {
        return $this
            ->where('user_id', $userId)
            ->findAll();

SELECT *
FROM `teams`
WHERE `id` = '1'
 LIMIT 1
---
    public function getTeam($id)
    {
        return $this
            ->where('id', $id)
            ->first();

UPDATE `teams` SET `nome` = 'Green Team', `pokemon1` = '', `pokemon2` = '', `pokemon3` = '510', `pokemon4` = '', `pokemon5` = '', `pokemon6` = '516', `updated_at` = '2026-07-06 23:44:21'
WHERE `teams`.`id` IN ('3')
---
    public function atualizarEquipe($id, array $dados)
    {
        return $this->update($id, $dados);